Tekla Open API Reference for Tekla Structures 2025
Point Constructor
Overload List
Name | Description
Point()
 Instantiates a point with zero members.
Point(Point)
 Instantiates a point with the given other point.
Point(Double, Double)
 Instantiates a point with the given coordinates and zero Z-coordinate.
Point(Double, Double, Double)
 Instantiates a point with the given coordinates.
Top
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace